{"class_name": "Model", "keras_version": "2.0.8", "config": {"layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 200, 200, 3], "sparse": false}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [2, 2], "name": "conv2d_1", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 32, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "valid", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"name": "batch_normalization_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"name": "activation_1", "activation": "relu", "trainable": false}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_2", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 32, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "valid", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"name": "batch_normalization_2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_2", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"name": "activation_2", "activation": "relu", "trainable": false}}, {"name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_3", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 64, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"name": "batch_normalization_3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_3", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"name": "activation_3", "activation": "relu", "trainable": false}}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "padding": "valid", "pool_size": [3, 3], "trainable": false}}, {"name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_4", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 80, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "valid", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"name": "batch_normalization_4", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_4", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"name": "activation_4", "activation": "relu", "trainable": false}}, {"name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_5", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 192, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "valid", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"name": "batch_normalization_5", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_5", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"name": "activation_5", "activation": "relu", "trainable": false}}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "padding": "valid", "pool_size": [3, 3], "trainable": false}}, {"name": "conv2d_9", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_9", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 64, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"name": "batch_normalization_9", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_9", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"name": "activation_9", "activation": "relu", "trainable": false}}, {"name": "conv2d_7", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_7", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 48, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "conv2d_10", "class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_10", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 96, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"name": "batch_normalization_7", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"name": "batch_normalization_10", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_7", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"name": "activation_7", "activation": "relu", "trainable": false}}, {"name": "activation_10", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"name": "activation_10", "activation": "relu", "trainable": false}}, {"name": "average_pooling2d_1", "class_name": "AveragePooling2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"strides": [1, 1], "name": "average_pooling2d_1", "data_format": "channels_last", "padding": "same", "pool_size": [3, 3], "trainable": false}}, {"name": "conv2d_6", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_6", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 64, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "conv2d_8", "class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_8", "kernel_size": [5, 5], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 64, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "conv2d_11", "class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_11", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 96, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "conv2d_12", "class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_12", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 32, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"name": "batch_normalization_6", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"name": "batch_normalization_8", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"name": "batch_normalization_11", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"name": "batch_normalization_12", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_6", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"name": "activation_6", "activation": "relu", "trainable": false}}, {"name": "activation_8", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"name": "activation_8", "activation": "relu", "trainable": false}}, {"name": "activation_11", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"name": "activation_11", "activation": "relu", "trainable": false}}, {"name": "activation_12", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"name": "activation_12", "activation": "relu", "trainable": false}}, {"name": "mixed0", "class_name": "Concatenate", "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]], "config": {"name": "mixed0", "axis": 3, "trainable": false}}, {"name": "conv2d_16", "class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_16", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 64, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"name": "batch_normalization_16", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_16", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "config": {"name": "activation_16", "activation": "relu", "trainable": false}}, {"name": "conv2d_14", "class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_14", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 48, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "conv2d_17", "class_name": "Conv2D", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_17", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 96, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"name": "batch_normalization_14", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "batch_normalization_17", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"name": "batch_normalization_17", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_14", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"name": "activation_14", "activation": "relu", "trainable": false}}, {"name": "activation_17", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "config": {"name": "activation_17", "activation": "relu", "trainable": false}}, {"name": "average_pooling2d_2", "class_name": "AveragePooling2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"strides": [1, 1], "name": "average_pooling2d_2", "data_format": "channels_last", "padding": "same", "pool_size": [3, 3], "trainable": false}}, {"name": "conv2d_13", "class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_13", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 64, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "conv2d_15", "class_name": "Conv2D", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_15", "kernel_size": [5, 5], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 64, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "conv2d_18", "class_name": "Conv2D", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_18", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 96, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "conv2d_19", "class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_19", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 64, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"name": "batch_normalization_13", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"name": "batch_normalization_15", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "batch_normalization_18", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"name": "batch_normalization_18", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "batch_normalization_19", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"name": "batch_normalization_19", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_13", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "config": {"name": "activation_13", "activation": "relu", "trainable": false}}, {"name": "activation_15", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "config": {"name": "activation_15", "activation": "relu", "trainable": false}}, {"name": "activation_18", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "config": {"name": "activation_18", "activation": "relu", "trainable": false}}, {"name": "activation_19", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "config": {"name": "activation_19", "activation": "relu", "trainable": false}}, {"name": "mixed1", "class_name": "Concatenate", "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]], "config": {"name": "mixed1", "axis": 3, "trainable": false}}, {"name": "conv2d_23", "class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_23", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 64, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "batch_normalization_23", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"name": "batch_normalization_23", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_23", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "config": {"name": "activation_23", "activation": "relu", "trainable": false}}, {"name": "conv2d_21", "class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_21", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 48, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "conv2d_24", "class_name": "Conv2D", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_24", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 96, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "batch_normalization_21", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"name": "batch_normalization_21", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "batch_normalization_24", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "config": {"name": "batch_normalization_24", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_21", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "config": {"name": "activation_21", "activation": "relu", "trainable": false}}, {"name": "activation_24", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "config": {"name": "activation_24", "activation": "relu", "trainable": false}}, {"name": "average_pooling2d_3", "class_name": "AveragePooling2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"strides": [1, 1], "name": "average_pooling2d_3", "data_format": "channels_last", "padding": "same", "pool_size": [3, 3], "trainable": false}}, {"name": "conv2d_20", "class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_20", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 64, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "conv2d_22", "class_name": "Conv2D", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_22", "kernel_size": [5, 5], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 64, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "conv2d_25", "class_name": "Conv2D", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_25", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 96, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "conv2d_26", "class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_26", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 64, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "batch_normalization_20", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"name": "batch_normalization_20", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "batch_normalization_22", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"name": "batch_normalization_22", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "batch_normalization_25", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "config": {"name": "batch_normalization_25", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "batch_normalization_26", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "config": {"name": "batch_normalization_26", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_20", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "config": {"name": "activation_20", "activation": "relu", "trainable": false}}, {"name": "activation_22", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "config": {"name": "activation_22", "activation": "relu", "trainable": false}}, {"name": "activation_25", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "config": {"name": "activation_25", "activation": "relu", "trainable": false}}, {"name": "activation_26", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "config": {"name": "activation_26", "activation": "relu", "trainable": false}}, {"name": "mixed2", "class_name": "Concatenate", "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]], "config": {"name": "mixed2", "axis": 3, "trainable": false}}, {"name": "conv2d_28", "class_name": "Conv2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_28", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 64, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "batch_normalization_28", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "config": {"name": "batch_normalization_28", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_28", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "config": {"name": "activation_28", "activation": "relu", "trainable": false}}, {"name": "conv2d_29", "class_name": "Conv2D", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_29", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 96, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "batch_normalization_29", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "config": {"name": "batch_normalization_29", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_29", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "config": {"name": "activation_29", "activation": "relu", "trainable": false}}, {"name": "conv2d_27", "class_name": "Conv2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [2, 2], "name": "conv2d_27", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 384, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "valid", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "conv2d_30", "class_name": "Conv2D", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [2, 2], "name": "conv2d_30", "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 96, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "valid", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "batch_normalization_27", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "config": {"name": "batch_normalization_27", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "batch_normalization_30", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "config": {"name": "batch_normalization_30", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_27", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "config": {"name": "activation_27", "activation": "relu", "trainable": false}}, {"name": "activation_30", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "config": {"name": "activation_30", "activation": "relu", "trainable": false}}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"strides": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last", "padding": "valid", "pool_size": [3, 3], "trainable": false}}, {"name": "mixed3", "class_name": "Concatenate", "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "config": {"name": "mixed3", "axis": 3, "trainable": false}}, {"name": "conv2d_35", "class_name": "Conv2D", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_35", "kernel_size": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 128, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "batch_normalization_35", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "config": {"name": "batch_normalization_35", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_35", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "config": {"name": "activation_35", "activation": "relu", "trainable": false}}, {"name": "conv2d_36", "class_name": "Conv2D", "inbound_nodes": [[["activation_35", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_36", "kernel_size": [7, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_constraint": null, "trainable": false, "filters": 128, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same", "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}}, {"name": "batch_normalization_36", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "config": {"name": "batch_normalization_36", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "axis": 3, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_36", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]], "config": {"name": "activation_36", "activation": "relu", "trainable": false}}, {"name": "conv2d_32", "class_name": "Conv2D", "inbound_nodes": 